УТ_для_edt.РасширениеСмарт/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.смартОстаткиНаСкладеГарантийныхЗапчастей</registerRecords>
  <attributes>
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПорядокДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗонаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>УпаковочныйЛистРодитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Documents/РасходныйОрдерНаТовары/Forms/ФормаДокумента/Module.bsl
//++ #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
// ВАЖНО !!!
// Код ниже оставил. Требуется рефакторинг. Следует сделать так:
// - перед записью объекта провести анализ, сообщить пользователю, что требуется заполнить Заявки
// - сделать кнопку для заполнения, при нажатии, заполняется и документ записывается

//++ смарт:ММ #044 224 24.02.2021 - Заявка на гарантийный ремонт 
&НаКлиенте
Процедура смарт_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	
	// ++ 18.03.2021
	//Если ЭтотОбъект.смартНеПроверятьНомераЗаявок <> Истина Тогда
	Если НЕ ПараметрыЗаписи.Свойство("смартВыполнятьПроверкуОстатков")
		ИЛИ (ПараметрыЗаписи.Свойство("смартВыполнятьПроверкуОстатков") И ПараметрыЗаписи.смартВыполнятьПроверкуОстатков = Истина) Тогда
	// --
		Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			смартОбщегоНазначенияКлиент.ОбработатьПодборНомеровЗаявок(ЭтаФорма, Отказ);			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 24.02.2021

//++ смарт:ММ #044 224 24.02.2021 - Заявка на гарантийный ремонт
&НаКлиенте
Процедура смартПослеЗакрытияФормыПодбораНомеровЗаявок(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Массив") Тогда
		смартОбщегоНазначенияКлиент.смартЗаполнитьНомераЗаявокПоСтрокам(ЭтаФорма, РезультатЗакрытия);
		//++ #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
		//смартОбщегоНазначения.НастроитьВидимостьЭлементовФормы(ЭтаФорма);
		//-- #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
	КонецЕсли;

	// ++ 18.03.2021
	//ЭтотОбъект.смартНеПроверятьНомераЗаявок = Истина;
	//ЭтотОбъект.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	ЭтотОбъект.Записать(Новый Структура("РежимЗаписи, смартВыполнятьПроверкуОстатков", РежимЗаписиДокумента.Проведение, Ложь));
	// --
	
КонецПроцедуры //-- смарт:ММ 24.02.2021

&НаСервере
&После("ПриЧтенииСозданииНаСервере")
Процедура смарт_ПриЧтенииСозданииНаСервереПосле()
	
	//++#1517 смарт: Лопато 03.11.2023 //Установка статуса указания серий по дате начала серийного учета номенклатуры  
	смарт_УстановитьДатуПроверкиСерий();
	//--#1617 смарт: Лопато 03.11.2023
	
	//++ #Б5878 смарт: Шляпников 27.02.2026 / Маркировка радиоэлектронной продукции. Тестирование основного сценария. Выявление ошибок.
	смартМаркировка.ДобавитьВТабличнуюЧастьКолонкиМаркировки(ЭтаФорма, "ОтгружаемыеТовары", "ОтгружаемыеТоварыГруппаНоменклатураУпаковочныйЛист", "Объект.ОтгружаемыеТовары.Номенклатура");
	//-- #Б5878 смарт: Шляпников 27.02.2026
	
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	Элементы.ОтгружаемыеТовары.УстановитьДействие("ПриИзменении", "смартТоварыПриИзменении");
	//-- #Б6794 смарт: Шляпников 07.05.2026
	
КонецПроцедуры

&НаСервере
&После("ДатаОтгрузкиПриИзмененииСервер")
Процедура смарт_ДатаОтгрузкиПриИзмененииСерверПосле()

	//++#1517 смарт: Лопато 03.11.2023 //Установка статуса указания серий по дате начала серийного учета номенклатуры  
	ЗаполнитьСтатусыУказанияСерийСервер();
	ЗаполнитьСтатусыУказанияСерийТоварыПоРаспоряжениямСервер();
	//--#1617 смарт: Лопато 03.11.2023

КонецПроцедуры

&НаСервере
&После("СтатусПриИзмененииСервер")
Процедура смарт_СтатусПриИзмененииСервер(ЗаполнятьПоотобраннымТоварам, НовыйСтатус)
	
	//++#1517 смарт: Лопато 25.01.2024 //Установка статуса указания серий по дате начала серийного учета номенклатуры
	ЗаполнитьСтатусыУказанияСерийСервер();
	ЗаполнитьСтатусыУказанияСерийТоварыПоРаспоряжениямСервер();
	//--#1517 смарт: Лопато 25.01.2024
	
КонецПроцедуры

//++#1517 смарт: Лопато 03.11.2023 //Установка статуса указания серий по дате начала серийного учета номенклатуры  
&НаСервере
Процедура смарт_УстановитьДатуПроверкиСерий()

	Если ЗначениеЗаполнено(Объект.ДатаОтгрузки) Тогда
		ДатаСерий = Объект.ДатаОтгрузки;
	ИначеЕсли ЗначениеЗаполнено(Объект.Дата) Тогда
		ДатаСерий = Объект.Дата;
	Иначе	
		ДатаСерий = ТекущаяДатаСеанса();
	КонецЕсли;	
	
	ПараметрыУказанияСерий.ТоварыПоРаспоряжениям.Дата = ДатаСерий;
	ПараметрыУказанияСерий.ОтгружаемыеТовары.Дата 	  = ДатаСерий;

КонецПроцедуры //--#1617 смарт: Лопато 03.11.2023

//++#1517 смарт: Лопато 20.12.2023 //Установка статуса указания серий по дате начала серийного учета номенклатуры
&НаКлиенте
Процедура смартЗаполнитьСтатусыУказанияСерий()

	ЗаполнитьСтатусыУказанияСерийСервер();
	
КонецПроцедуры //--#1517 смарт: Лопато 20.12.2023	

//++#1517 смарт: Лопато 20.12.2023 //Установка статуса указания серий по дате начала серийного учета номенклатуры
&НаКлиенте
Процедура смартЗаполнитьСтатусыУказанияСерийТоварыПоРаспоряжениям()

	ЗаполнитьСтатусыУказанияСерийТоварыПоРаспоряжениямСервер();
	
КонецПроцедуры //--#1517 смарт: Лопато 20.12.2023	

//++#1517 смарт: Лопато 20.12.2023 //Установка статуса указания серий по дате начала серийного учета номенклатуры
&НаСервере
Процедура ЗаполнитьСтатусыУказанияСерийСервер()

	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.РасходныйОрдерНаТовары));
	
	смарт_УстановитьДатуПроверкиСерий();
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий.ОтгружаемыеТовары);
	
КонецПроцедуры //--#1517 смарт: Лопато 20.12.2023	

//++#1517 смарт: Лопато 20.12.2023 //Установка статуса указания серий по дате начала серийного учета номенклатуры
&НаСервере
Процедура ЗаполнитьСтатусыУказанияСерийТоварыПоРаспоряжениямСервер()

	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.РасходныйОрдерНаТовары));

	смарт_УстановитьДатуПроверкиСерий();
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий.ТоварыПоРаспоряжениям);
	
КонецПроцедуры //--#1517 смарт: Лопато 20.12.2023	

//++ #6602 смарт: Тимофеева 23.04.2026 / Маркировка радиоэлектронной продукции. Системные уведомления пользователей. 
&НаСервере
Процедура смарт_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И смартМаркировка.КонтроллироватьОтгрузкуМаркированнойПродукции(ТекущийОбъект.Дата) 
		Тогда 		
		ТаблицаМаркируемыйТовар = смартМаркировка.ПолучитьМаркируемыйТоварИзКоллекции(ТекущийОбъект.ТоварыПоРаспоряжениям.Выгрузить(), Объект.Дата);
		Если ТаблицаМаркируемыйТовар.Количество() > 0 Тогда
			РеализацииСНеподобраннымиШтрихкодамиУпаковок = смартМаркировка.ПолучитьРеализацииСНеподобраннымиШтрихкодамиУпаковок(ТаблицаМаркируемыйТовар);
			Для Каждого РеализацияТоваровУслугСсылка Из РеализацииСНеподобраннымиШтрихкодамиУпаковок Цикл
				ТекстСообщения = СтрШаблон("В документе содержится маркируемый товар. Необходимо в %1 указать коды маркировки отгружаемого товара с помощью механизма ""Подбор маркировки""", 
										РеализацияТоваровУслугСсылка);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, РеализацияТоваровУслугСсылка, , );
				Если ТекущийОбъект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.Отгружен") Тогда
					Отказ = Истина;
				КонецЕсли;
			КонецЦикла;				
		КонецЕсли;		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПослеЗаписи")
Процедура смарт_ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_РасходныйОрдерНаТовары", ПараметрыЗаписи, Объект.Ссылка);

	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	#Вставка
	//++ #Б6778 смарт: Шляпников 04.05.2026 / Маркировка товара. Экспериментальный режим маркировки.
	смартМаркировкаКлиент.ВывестиСообщениеОНаличииТоваровСЭкспериментальнойМаркировкой(Объект);
	//-- #Б6778 смарт: Шляпников 04.05.2026
	
	//++ #Б6824 смарт: Шляпников 08.06.2026 / Маркировка. Внутреннее движение товара в 1С УТ РФ.
	смартМаркировкаКлиент.ВывестиСообщениеОНеобходимостиСканированияТоваровСОбязательнойМаркировкой(Объект);
	//-- #Б6824 смарт: Шляпников 08.06.2026

	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6794 смарт: Шляпников 07.05.2026
	#КонецВставки
	
КонецПроцедуры
//-- #6602 смарт: Тимофеева 23.04.2026

//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
&НаСервере
Процедура ЗаполнитьДанныеОМаркировкеНоменклатуры()
	
	смартМаркировка.ЗаполнитьИнформациюОМаркировкеВТаблицуНоменклатуры(Объект.ОтгружаемыеТовары);
	
КонецПроцедуры


//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
&НаКлиенте
Процедура смартТоварыПриИзменении(Элемент)

	ЗаполнитьДанныеОМаркировкеНоменклатуры();

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОбработкаВыбора")
Процедура смарт_ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	ТекущиеДанные = Элементы.ОтгружаемыеТовары.ТекущиеДанные;

	Если ИсточникВыбора.ИмяФормы = "Обработка.ПроверкаКоличестваТоваровВДокументе.Форма.Форма" Тогда

		ОбработатьПроверкуКоличестваТоваровНаСервере(ВыбранноеЗначение);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаВыбора" Тогда

		ТекущиеДанные.Номенклатура = ВыбранноеЗначение;

		НоменклатураПриИзмененииСервер(КэшированныеЗначения);

		Элементы.ОтгружаемыеТовары.ТекущийЭлемент = Элементы.ОтгружаемыеТоварыКоличествоУпаковок;
		Элементы.ОтгружаемыеТовары.ТекущийЭлемент = Элементы.ОтгружаемыеТоварыНоменклатура;

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.УпаковочныйЛист.Форма.ФормаВыбора" Тогда

		ТекущиеДанные.УпаковочныйЛист = ВыбранноеЗначение;
		УпаковочныйЛистПриИзмененииСервер(КэшированныеЗначения);
		Элементы.ОтгружаемыеТовары.ЗакончитьРедактированиеСтроки(Ложь);

	ИначеЕсли НоменклатураКлиент.ЭтоУказаниеСерий(ИсточникВыбора) Тогда
		НоменклатураКлиент.ОбработатьУказаниеСерии(ЭтаФорма, ПараметрыУказанияСерий.ТоварыПоРаспоряжениям, ВыбранноеЗначение);
	КонецЕсли;
	
	#Вставка
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	Элементы.Товары.УстановитьДействие("ПриИзменении", "смартТоварыПриИзменении");
	//-- #Б6794 смарт: Шляпников 07.05.2026
	#КонецВставки
	
КонецПроцедуры
